app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
SELECT "accounts".* FROM "accounts" WHERE "accounts"."accounttype" = 'Liability'
---
  def index
    @account_types = [["Asset", "Asset"], ["Liability", "Liability"], ["Expense", "Expense"], ["Capital", "Capital"]]
    @allAccounts = Account.all
    @asset = 0
    @expense = 0
    @liability = 0



    if (params[:account_type] == nil or params[:account_type] == "")
      @accounts = Account.all
    elsif
      @accounts = Account.find_all_by_accounttype(params[:account_type])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @account_types = [["Asset", "Asset"], ["Liability", "Liability"], ["Expense", "Expense"], ["Capital", "Capital"]]
    @account = Account.find_by_id(params[:id])

INSERT INTO "accounts" ("accounttype", "amount", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["accounttype", "Asset"], ["amount", 0], ["created_at", Sun, 25 Jan 2015 12:29:43 UTC +00:00], ["name", "Test"], ["updated_at", Sun, 25 Jan 2015 12:29:43 UTC +00:00]]
---
  def create
    @account = Account.new(params[:account])
    @account.save

UPDATE "accounts" SET "accounttype" = 'Asset', "amount" = 1800000, "updated_at" = '2015-01-29 13:15:27.797657' WHERE "accounts"."id" = 9
---
  def update
    @account.update_attributes(params[:account])