app/controllers/transactions_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def new
    @transaction = Transaction.new
    @accounts = Account.all

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "accounts".* FROM "accounts"
---
  def edit
    @transaction = Transaction.find_by_id(params[:id])
    @accounts = Account.all

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 2 LIMIT 1
INSERT INTO "transactions" ("amount", "created_at", "first_account_id", "second_account_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 500], ["created_at", Sat, 31 Jan 2015 21:25:30 UTC +00:00], ["first_account_id", 2], ["second_account_id", 7], ["updated_at", Sat, 31 Jan 2015 21:25:30 UTC +00:00]]
---
  def create
    @valid = false

    if (Account.find_by_id(params[:transaction][:first_account_id])==Account.find_by_id(params[:transaction][:second_account_id]))
        flash[:notice] = "From and To acccounts can't be the same!."
        redirect_to :back

    else
      @valid = Account.validate_transaction(params[:transaction][:first_account_id],
                                          params[:transaction][:second_account_id],
                                          params[:transaction][:amount])
    if (@valid == true)
      @transaction = Transaction.new(params[:transaction])
      @transaction.save

UPDATE "transactions" SET "amount" = 100, "updated_at" = '2015-01-31 11:54:13.889390' WHERE "transactions"."id" = 1
---
  def update
    @transaction.update_attributes(params[:transaction])

DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]
---
  def destroy
    @transaction.destroy