app/views/transactions/index.html.erb

    <td class="lalign"><%= transaction.first_direction %></td>
    <td class="lalign"><%= Account.find_by_id(transaction.first_account_id).name %></td>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 2 LIMIT 1